{"version":"https://jsonfeed.org/version/1","title":"blog // Drew Powers","items":[{"id":"http://pow.rs/blog/posts/responsive-type-scales-in-css.html","url":"http://pow.rs/blog/posts/responsive-type-scales-in-css.html","title":"responsive type scales: the correct way to handle font sizes in css","content_html":"There actually is an easy, quick way to configure font sizes, it works universally in both CSS and CSS-in-JS, and it’s even responsive. You’re just not using it.","content_text":null,"date_published":"Sun, 02 Aug 2020 12:00:00 +0000","tags":[]},{"id":"http://pow.rs/blog/posts/was-html-a-mistake.html","url":"http://pow.rs/blog/posts/was-html-a-mistake.html","title":"was HTML a mistake?","content_html":"OK, hear me out. Even if Betteridge is right and the answer at the end of this blog post ends up being “no,” let’s treat the question “was HTML a mistake?” purely as a thought experiment. And it may shed light on some of the more frustrating parts of making websites.","content_text":null,"date_published":"Sun, 19 Apr 2020 12:00:00 +0000","tags":[]},{"id":"http://pow.rs/blog/posts/the-state-of-es-modules-in-2020.html","url":"http://pow.rs/blog/posts/the-state-of-es-modules-in-2020.html","title":"JavaScript's greatest revolution was too quiet","content_html":"<strong>In 2019, a revolution happened in JS.</strong> You may have missed it. All major browsers and Node.js added native support for ES Modules (ESM)—no Babel, transpiling, preprocessing, or trickery needed.","content_text":null,"date_published":"Sun, 08 Mar 2020 12:00:00 +0000","tags":[]},{"id":"http://pow.rs/blog/posts/3-pillars-of-front-end-knowledge.html","url":"http://pow.rs/blog/posts/3-pillars-of-front-end-knowledge.html","title":"the great(er) divide in front-end","content_html":"My initial reaction to Chris Coyier’s <em>The Great Divide</em> post almost a year ago was to reject it. To be blunt, I saw it as someone who made their career on CSS attacking the good work that JavaScript folks had been doing because it threatened his career (I say that as someone respects Chris immensely, but people are allowed to be wrong in blog posts).","content_text":null,"date_published":"Mon, 17 Feb 2020 12:00:00 +0000","tags":[]},{"id":"http://pow.rs/blog/posts/media-queries-are-still-a-hack.html","url":"http://pow.rs/blog/posts/media-queries-are-still-a-hack.html","title":"media queries are (still) a hack","content_html":"After 15 years of working with CSS, media queries still don’t do enough for me to create responsive designs. To express my frustrations, I had written about half of a blog post under the title <em>Media Queries are a Hack</em> before I discovered that title had been taken. In <strong>2013</strong>. Clearly I’m not as original as I think I am.","content_text":null,"date_published":"Sat, 18 Jan 2020 12:00:00 +0000","tags":[]},{"id":"http://pow.rs/blog/posts/playfulness-budget.html","url":"http://pow.rs/blog/posts/playfulness-budget.html","title":"4 tips for setting a playfulness budget","content_html":"All of us can recall being frustrated by a website or app, as well as inspired and entertained. Sometimes those feelings can happen with the same app, either at different points in the experience or perhaps we were in a different state of mind. Application design always walks a tightrope between utility and whimsy. An app must use familiar patterns to be usable, but if <em>nothing</em> new is introduced it will be a forgettable experience. But while <em>some</em> novelty is required, if <em>everything</em> reinvents the wheel you’ve created a frustrating experience that users are lost in. How do you find a balance?","content_text":null,"date_published":"Wed, 06 Nov 2019 12:00:00 +0000","tags":[]}],"home_page_url":"http://pow.rs/blog","description":"The personal blog of Drew Powers"}